In [100]:
import pandas as pd
import numpy as np
import datetime as dt
import re

In [87]:
twitter = pd.read_csv('datasets/data_elonmusk.csv', encoding= 'unicode_escape')
tesla = pd.read_csv('datasets/tsla_stock_price.csv')
print(f"Tesla shape: {tesla.shape}")
print(f"Twitter shape: {twitter.shape}")

Tesla shape: (1227, 7)
Twitter shape: (3218, 5)

In [88]:
twitter.head()

,row ID,Tweet,Time,Retweet from,User
0,Row0,@MeltingIce Assuming max acceleration of 2 to ...,2017-09-29 17:39:19,NaN,elonmusk
1,Row1,RT @SpaceX: BFR is capable of transporting sat...,2017-09-29 10:44:54,SpaceX,elonmusk
2,Row2,@bigajm Yup :),2017-09-29 10:39:57,NaN,elonmusk
3,Row3,Part 2 https://t.co/8Fvu57muhM,2017-09-29 09:56:12,NaN,elonmusk
4,Row4,Fly to most places on Earth in under 30 mins a...,2017-09-29 09:19:21,NaN,elonmusk

In [89]:
tesla.head()

         Date       High        Low       Open      Close   Volume  Adj Close
0  2012-11-15  31.440001  30.500000  31.299999  30.820000   984000  30.820000
1  2012-11-16  32.000000  30.590000  31.150000  31.840000   908700  31.840000
2  2012-11-19  33.250000  31.840000  32.070000  32.919998  1392400  32.919998
3  2012-11-20  33.099998  31.910000  32.799999  33.000000   922500  33.000000
4  2012-11-21  33.470001  32.290001  32.610001  32.470001   963200  32.470001

In [90]:
twitter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3218 entries, 0 to 3217
Data columns (total 5 columns):
row ID          3218 non-null object
Tweet           3218 non-null object
Time            3218 non-null object
Retweet from    525 non-null object
User            3218 non-null object
dtypes: object(5)
memory usage: 125.8+ KB

In [91]:
twitter['Time'] = pd.to_datetime(twitter['Time'])
twitter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3218 entries, 0 to 3217
Data columns (total 5 columns):
row ID          3218 non-null object
Tweet           3218 non-null object
Time            3218 non-null datetime64[ns]
Retweet from    525 non-null object
User            3218 non-null object
dtypes: datetime64[ns](1), object(4)
memory usage: 125.8+ KB

In [92]:
twitter['Date'] = twitter['Time'].dt.date
twitter['Date'] = pd.to_datetime(twitter['Date'])
print(twitter.head())

  row ID                                              Tweet  \
0   Row0  @MeltingIce Assuming max acceleration of 2 to ...
1   Row1  RT @SpaceX: BFR is capable of transporting sat...
2   Row2                                     @bigajm Yup :)
3   Row3                     Part 2 https://t.co/8Fvu57muhM
4   Row4  Fly to most places on Earth in under 30 mins a...

                 Time Retweet from      User       Date
0 2017-09-29 17:39:19          NaN  elonmusk 2017-09-29
1 2017-09-29 10:44:54       SpaceX  elonmusk 2017-09-29
2 2017-09-29 10:39:57          NaN  elonmusk 2017-09-29
3 2017-09-29 09:56:12          NaN  elonmusk 2017-09-29
4 2017-09-29 09:19:21          NaN  elonmusk 2017-09-29

In [93]:
tesla.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1227 entries, 0 to 1226
Data columns (total 7 columns):
Date         1227 non-null object
High         1227 non-null float64
Low          1227 non-null float64
Open         1227 non-null float64
Close        1227 non-null float64
Volume       1227 non-null int64
Adj Close    1227 non-null float64
dtypes: float64(5), int64(1), object(1)
memory usage: 67.2+ KB

In [94]:
tesla['Date'] = pd.to_datetime(tesla['Date'])
print(tesla.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1227 entries, 0 to 1226
Data columns (total 7 columns):
Date         1227 non-null datetime64[ns]
High         1227 non-null float64
Low          1227 non-null float64
Open         1227 non-null float64
Close        1227 non-null float64
Volume       1227 non-null int64
Adj Close    1227 non-null float64
dtypes: datetime64[ns](1), float64(5), int64(1)
memory usage: 67.2 KB
None

In [95]:
twitter.head()

,row ID,Tweet,Time,Retweet from,User,Date
0,Row0,@MeltingIce Assuming max acceleration of 2 to ...,2017-09-29 17:39:19,NaN,elonmusk,2017-09-29
1,Row1,RT @SpaceX: BFR is capable of transporting sat...,2017-09-29 10:44:54,SpaceX,elonmusk,2017-09-29
2,Row2,@bigajm Yup :),2017-09-29 10:39:57,NaN,elonmusk,2017-09-29
3,Row3,Part 2 https://t.co/8Fvu57muhM,2017-09-29 09:56:12,NaN,elonmusk,2017-09-29
4,Row4,Fly to most places on Earth in under 30 mins a...,2017-09-29 09:19:21,NaN,elonmusk,2017-09-29

In [96]:
twitter.sort_values(by=['Date'], inplace=True, ascending=True)
twitter.reset_index(drop=True, inplace=True)
twitter.head()

,row ID,Tweet,Time,Retweet from,User,Date
0,Row3217,RT @Jon_Favreau: My Model S just arrived and I...,2012-11-16 17:59:47,Jon_Favreau,elonmusk,2012-11-16
1,Row3216,Just returned from a trip to London and Oxford...,2012-11-19 08:59:46,NaN,elonmusk,2012-11-19
2,Row3214,These articles in Space News describe why Aria...,2012-11-20 08:38:31,NaN,elonmusk,2012-11-20
3,Row3211,"Btw, I don't think Apple is doomed. Just won't...",2012-11-20 21:32:50,NaN,elonmusk,2012-11-20
4,Row3215,Was misquoted by BBC as saying Europe's rocket...,2012-11-20 08:30:44,NaN,elonmusk,2012-11-20

In [97]:
# drop unwanted columns
twitter = twitter.drop(['row ID', 'Time', 'Retweet from', 'User'], axis=1)

In [98]:
twitter.head()

                                               Tweet       Date
0  RT @Jon_Favreau: My Model S just arrived and I... 2012-11-16
1  Just returned from a trip to London and Oxford... 2012-11-19
2  These articles in Space News describe why Aria... 2012-11-20
3  Btw, I don't think Apple is doomed. Just won't... 2012-11-20
4  Was misquoted by BBC as saying Europe's rocket... 2012-11-20

In [101]:
# combining tweets with same date
index=0

for index, row in twitter.iterrows():
    stre = row['Tweet']
    
    # removing special characters
    new_string = re.sub('[^ a-zA-Z0-9]', '', stre)
    
    twitter.at[index, 'Date'] = row['Date']
    twitter.at[index, 'Tweet'] = new_string
    index = index + 1

twitter = twitter.groupby(['Date'], as_index=False).agg({'Tweet': ''.join}, inplace=True)

In [102]:
twitter.head()

        Date                                              Tweet
0 2012-11-16  RT JonFavreau My Model S just arrived and I we...
1 2012-11-19  Just returned from a trip to London and Oxford...
2 2012-11-20  These articles in Space News describe why Aria...
3 2012-11-21  Love this picture of the Curiousity rover on M...
4 2012-11-22  Gave a talk on energy and transport at Oxford ...

In [103]:
twitter.to_csv('twitter_cleaned.csv')

In [104]:
combined = twitter.merge(tesla, left_on='Date', right_on='Date')

In [105]:
combined.head()

,Date,Tweet,High,Low,Open,Close,Volume,Adj Close
0,2012-11-16,RT JonFavreau My Model S just arrived and I we...,32.000000,30.590000,31.150000,31.840000,908700,31.840000
1,2012-11-19,Just returned from a trip to London and Oxford...,33.250000,31.840000,32.070000,32.919998,1392400,32.919998
2,2012-11-20,These articles in Space News describe why Aria...,33.099998,31.910000,32.799999,33.000000,922500,33.000000
3,2012-11-21,Love this picture of the Curiousity rover on M...,33.470001,32.290001,32.610001,32.470001,963200,32.470001
4,2012-11-23,Liam Neesons Lifes Too Short sketch is super f...,32.830002,31.700001,32.599998,32.130001,430300,32.130001

In [106]:
combined.to_csv('combined_data.csv')

In [107]:
combined['price_diff'] = combined['Close'] - combined['Open']
combined.head()

,Date,Tweet,High,Low,Open,Close,Volume,Adj Close,price_diff
0,2012-11-16,RT JonFavreau My Model S just arrived and I we...,32.000000,30.590000,31.150000,31.840000,908700,31.840000,0.690001
1,2012-11-19,Just returned from a trip to London and Oxford...,33.250000,31.840000,32.070000,32.919998,1392400,32.919998,0.849998
2,2012-11-20,These articles in Space News describe why Aria...,33.099998,31.910000,32.799999,33.000000,922500,33.000000,0.200001
3,2012-11-21,Love this picture of the Curiousity rover on M...,33.470001,32.290001,32.610001,32.470001,963200,32.470001,-0.139999
4,2012-11-23,Liam Neesons Lifes Too Short sketch is super f...,32.830002,31.700001,32.599998,32.130001,430300,32.130001,-0.469997

In [109]:
target_list = []

for row in combined['price_diff']:
    if row > 0:
        target_list.append(1)
    else:
        target_list.append(0)

In [112]:
combined['inc_dec'] = target_list
combined['inc_dec'].value_counts()

0    319
1    314
Name: inc_dec, dtype: int64

In [113]:
combined.shape

(633, 10)

In [115]:
combined.head(10)

,Date,Tweet,High,Low,Open,Close,Volume,Adj Close,price_diff,inc_dec
0,2012-11-16,RT JonFavreau My Model S just arrived and I we...,32.000000,30.590000,31.150000,31.840000,908700,31.840000,0.690001,1
1,2012-11-19,Just returned from a trip to London and Oxford...,33.250000,31.840000,32.070000,32.919998,1392400,32.919998,0.849998,1
2,2012-11-20,These articles in Space News describe why Aria...,33.099998,31.910000,32.799999,33.000000,922500,33.000000,0.200001,1
3,2012-11-21,Love this picture of the Curiousity rover on M...,33.470001,32.290001,32.610001,32.470001,963200,32.470001,-0.139999,0
4,2012-11-23,Liam Neesons Lifes Too Short sketch is super f...,32.830002,31.700001,32.599998,32.130001,430300,32.130001,-0.469997,0
5,2012-11-27,But if humanity wishes to become a multiplanet...,32.660000,31.520000,32.130001,32.150002,910800,32.150002,0.020000,1
6,2012-11-28,Cant put my finger on it but for some reason t...,34.290001,31.910000,32.000000,33.230000,1525200,33.230000,1.230000,1
7,2012-11-29,shervin Thanks Shervin,34.000000,32.869999,33.439999,33.689999,1103400,33.689999,0.250000,1
8,2012-12-04,Am happy to report that Tesla was narrowly cas...,34.799999,33.549999,34.080002,33.900002,1263300,33.900002,-0.180000,0
9,2012-12-05,Interesting possible answer to the Fermi Parad...,34.189999,33.580002,33.820000,33.709999,661500,33.709999,-0.110001,0

In [116]:
combined.tail(10)

,Date,Tweet,High,Low,Open,Close,Volume,Adj Close,price_diff,inc_dec
623,2017-09-14,jovanik21 Most of itLong road to reusabity of ...,377.959991,362.630005,364.329987,377.640015,7202500,377.640015,13.310028,1
624,2017-09-15,bonnienorman Of course,380.000000,372.700012,374.510010,379.809998,5420500,379.809998,5.299988,1
625,2017-09-19,JimHeaney Absolutely Moreover we expect to exp...,382.390015,373.570007,380.000000,375.100006,6451900,375.100006,-4.899994,0
626,2017-09-20,ItsSubhamk Dont give up if the cause is import...,378.250000,371.070007,373.000000,373.910004,4919100,373.910004,0.910004,1
627,2017-09-22,RT MotorTrend Shocking winner of our latest Wo...,369.899994,350.880005,366.489990,351.089996,8159400,351.089996,-15.399994,0
628,2017-09-25,Daimler GoodMajor improvements some unexpecte...,357.470001,342.880005,353.149994,344.989990,7605900,344.989990,-8.160004,0
629,2017-09-26,Simulation of how the SpaceX Interplanetary Sp...,351.239990,340.899994,350.929993,345.250000,7156300,345.250000,-5.679993,0
630,2017-09-27,Headed to Adelaide soon to describe new BFR pl...,351.489990,340.500000,349.899994,340.970001,6060300,340.970001,-8.929993,0
631,2017-09-28,RT mayemusk covergirl Im so excited to say tha...,342.750000,335.399994,339.880005,339.600006,5319600,339.600006,-0.279999,0
632,2017-09-29,RT SpaceX BFR is capable of transporting satel...,344.679993,338.600006,341.859985,341.100006,5107100,341.100006,-0.759979,0

In [117]:
combined.drop(['High', 'Low', 'Volume', 'Adj Close', 'price_diff'], axis=1, inplace=True)
combined.head(10)

,Date,Tweet,Open,Close,inc_dec
0,2012-11-16,RT JonFavreau My Model S just arrived and I we...,31.150000,31.840000,1
1,2012-11-19,Just returned from a trip to London and Oxford...,32.070000,32.919998,1
2,2012-11-20,These articles in Space News describe why Aria...,32.799999,33.000000,1
3,2012-11-21,Love this picture of the Curiousity rover on M...,32.610001,32.470001,0
4,2012-11-23,Liam Neesons Lifes Too Short sketch is super f...,32.599998,32.130001,0
5,2012-11-27,But if humanity wishes to become a multiplanet...,32.130001,32.150002,1
6,2012-11-28,Cant put my finger on it but for some reason t...,32.000000,33.230000,1
7,2012-11-29,shervin Thanks Shervin,33.439999,33.689999,1
8,2012-12-04,Am happy to report that Tesla was narrowly cas...,34.080002,33.900002,0
9,2012-12-05,Interesting possible answer to the Fermi Parad...,33.820000,33.709999,0

In [118]:
combined.to_csv('dataset_with_target.csv')